def contents_prompt(document_text: str = "Текст для формування змісту не надійшов, проінформуй про це",
                    previous_gpt_response: str = "") -> list:
    messages = [
        {"role": "developer", "content": (
            "Ти аналітик текстів, який вміє аналізувати та будувати зміст тексту і вибирати тези або цитати.\n"
            "Ти надаєш тільки чітку відповідь чистим без форматування текстом, не використовуючи жирний шрифт тощо."
        )},
        {"role": "user", "content": (
            "Створи пронумерований зміст наступного текстового документа, використовуючи пункти (тільки не придумуй "
            "зайві пункти), але не використовуючи підпункти до сформованих тобою пунктів:\n" f"{document_text}\n"
            "Обов'язково в самому кінці напиши сформовану тобою точну кількість пунктів без нічого зайвого, "
            "де замість знака питання ти тільки вставляєш числом кількість сформованих тобою пунктів змісту, "
            "наступним чином:\nКількість пунктів - ?"
            "\nСистемна примітка: текст може містити помилки кодування, наприклад позначені як �"
            "\nПроаналізуй вміст, враховуючи можливе пошкодження даних, надай коректну відповідь без помилок кодування."
        )}
    ]
    if previous_gpt_response:
        messages.append({"role": "assistant", "content": previous_gpt_response})
        messages.append({"role": "user", "content": (
            "Створи відповідь, де для кожного сформованого раніше тобою пункту змісту, знайди по декілька "
            "ключових тез або цитат з відповідного розділу, раніше проаналізованого тобою текстового документу."
            "\nСистемна примітка: текст може містити помилки кодування, наприклад позначені як �"
            "\nПроаналізуй вміст, враховуючи можливе пошкодження даних, надай коректну відповідь без помилок кодування."
            "\nЯкщо теза або цитата містить помилку кодування, то її надавати у відповідь строго забороняється."
        )})
    return messages
